

import asyncio
from collections import deque

from .. import eor, jmthon_cmd


A = (" ¤\n𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - قائمــة الاوامــر العــامــه](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
"⌔ مـرحبـاً عـزيـزي  𖤍\n"
"⌔  اضغـط ع الامـر لـ النسـخ\n"
"⌔ لا تنسى وضـع نقطه (.) بداية كل امـر :\n\n"

" `.م1`   **➪ اوامــر البحـث والتحميــل**\n" 
" `.م2`   **➪ اوامــر البــحث الصــور**\n"
" `.م3`   **➪ اوامــر الـوقتــي**\n"
" `.م4`   **➪ اوامــر المجمــوعــه**\n"
" `.م5`   **➪ اوامــر حمـاية الخـاص**\n"
" `.م6`   **➪ اوامــر تحــديد المــوقع**\n"
" `.م7`   **➪ اوامــر سـرعه الـنت**\n"
" `.م8`   **➪ اوامــر المــرح**\n"
" `.م9`   **➪ اوامــر التســليـه**\n"
" `.م10` **➪ اوامــر التســليه¹**\n"
" `.م11` **➪ اوامــر التســليه²**\n"
" `.م12` **➪ اوامــر الستـوريات**\n"
" `.م13` **➪ اوامــر الآفتــارات**\n"
" `.م14` **➪ اوامـر حسـاب العمـر**\n"
" `.م15` **➪ اوامــر النشــر التلقــائي**\n"
" `.م16` **➪ اوامــر الفــحص**\n"
" `.م17` **➪ اوامــر التهكــير**\n"
" `.م18` **➪ اوامــر الايــدي**\n"
" `.م19` **➪ اوامــر التفليــش**\n"
" `.م20` **➪ اوامــر التكــرار**\n"
" `.م21` **➪ اوامــر المطــور المســاعـد ( المتحكم )**\n"
" `.م22` **➪ اوامــر الـذاتيــة و التخزيــن**\n"
" `.م23` **➪ اوامــر الانتحال والتقليد**\n"
" `.م24` **➪ اوامــر الملصقات والمتحركه**\n"
" `.م25` **➪ الاعدادات**\n"
)

B = (
    "**❃ جميع هذه الاوامر تستخدم بالأرسال فقط**\n\n"
"❃ `.تحميل صوتي` <(رابط يوتيوب/او اي رابط)>\n"
   "**⌔∮ لـ تحميل الملف بشكل ملف صوتي في التليجرام، يمكنك وضع رابط اي منصة**\n\n\n"


"❃ `.تحميل فيد` <(رابط يوتيوب/او اي رابط)>\n"
   "**⌔∮ لـ تحميل الملف بشكل فيديو في التليجرام، يمكنك وضع رابط اي منصة**\n\n\n"


"❃ `.صوتي` <(عنوان)>\n"
   "**⌔∮ لـ تحميل الملف بشكل ملف صوتي في التليجرام من خلال العنوان فقط بدون رابط**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

D = (
    "**❃ جميع هذه الاوامر تستخدم بالأرسال فقط**\n\n"

"❃ `.صور`  + محتوى الصور\n"
   "**⌔∮ هاذا الامر يقوم بالبحث عن الصـور مثلا اكتب .صور قطط\n\n"
    
"❃ `.خلفيات` + محتوى الخلفيات\n"
   "**⌔∮ هاذا الامر يقوم بالبحث عن خلفيات مثلا اكتب .خلفيات قطط\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

E = (
      "**❃ جميع هذه الاوامر تستخدم بالأرسال فقط**\n\n"
"❃ `.اسم وقتي`\n"
"❃ `.تعيين خط الوقت normal`   》𝟙𝟘 \n"
"❃ `.تعيين خط الوقت bold`      》𝟭𝟬 \n"
"❃ `.تعيين خط الوقت circle`     》①⓿ \n"
"❃ `.تعيين خط الوقت wide`      》１０ \n"
"❃ `.تعيين خط الوقت small`     》¹⁰ \n"
   "**⌔∮لـ بدأ وضع الساعة مع اسمك حسابك**\n\n"

"❃ `.انهاء اسم وقتي`\n"
  " **⌔∮لـ تعطيل ظهور الساعة مع الأسم الخاص بك**\n\n"

"❃ `.بايو وقتي`\n"
   "**⌔∮لـ بدأ وضع الساعة مع النبذة/البايو الخاص بك**\n\n"

"❃ `.انهاء اسم وقتي`\n"
   "**⌔∮لـ تعطيل ظهور الوقت مع النبذة الخاصة بك**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"   
)
G = (
        "**❃ جميع هذه الاوامر تستخدم برد فقط**\n\n"

"❃ `.تشغيل الرد`  (لتشغيل حماية الخاص)\n"
"❃ `.تعطيل الرد`  (لتعطيل حماية الخاص )\n"
"❃ `.تعيين كليشة  (الرد`  برد على الكليشـه)\n"
"❃ `.تعيين صورة  (الرد`  برد على الصورة) \n"
"❃ `.تعيين كليشة الحظر`  (برد على الكليشـه) \n"
"❃ `.تعيين صورة الحظر`  (برد على الصورة)\n"
"❃ `.التحذيرات`   (معا عدد التحذيرات) \n"

"❃  `.كتم` <وضع ايديه/ بالرد عليه>\n"
    "**⌔∮لـ كتم المستخدم في المحادثة وحذف رسائله التي سيرسلها.**\n\n"

"❃  `.الغاء كتم` <وضع ايديه/ بالرد عليه>\n"
    "**⌔∮لـ الغاء كتم المستخدم وعدم حذف رسائله والسماح له بالارسال**\n\n"
    
"❃ `.سماح`\n"
    "**يستخدم بأرسال الأمر عند المستخدم أو بكتابة الأمر مع معرف المستخدم او بالرد عليه**\n\n"
   " **⌔∮لـ السماح للمستخدم بالتواصل معك وأيقاف نظام الحماية معه**\n\n"

"❃ `.رفض`\n"
    "**يستخدم بأرسال الأمر عند المستخدم أو بكتابة الأمر مع معرف المستخدم او بالرد عليه**\n"
   " **⌔∮لـ رفض للمستخدم من التواصل معك وأرجاع نظام الحماية شغال معه**\n\n"

"❃ `.بلوك`\n"
   " **الاستخدام: بأرسال الأمر عند المستخدم أو بكتابة الأمر مع معرف المستخدم او بالرد عليه**\n"
   " **⌔∮الشرح: لحظر المستخدم من التواصل معك على الخاص**\n\n"


"❃ `.الغاء البلوك` | `.الغاء البلوك للكل`\n"
   " **يستخدم هذا بأرساله عند المستخدم في الدردشة الخاصة**\n"
   " **⌔∮لـ الغاء حظر المستخدم من الخاصة واذا كتبت مع الامر للكل سيلغي حظر جميع المحظورين**\n\n"


"❃ `.تشغيل الارشفة`\n"
    "**⌔∮لـ أرشفة المحادثات الجديدة**\n\n"

"❃ `.ايقاف الارشفة`\n"
   " **⌔∮لـ أيقاف أرشفة المحادثات الجديدة**\n\n"

"❃ `.مسح الارشفة`\n"
   " **⌔∮لـ حذف جميع المحادثات المؤرشفة**\n\n"

"❃ `.قائمة المسموحين`\n"
   "**⌔∮لعرض قائمة المستخدمين المسموح لهم بالدردشة معك**\n\n"

"**⌔∮ هذه الاوامر تعمل فقط حين تشغيل نظام حماية الخاص🧸♥️**\n\n"
        
"❃ `.تفعيل حماية الحساب`\n"
   " **⌔∮بعد تفعيل الامر اي شخص سيحاول التسجيل/الدخول الى حسابك التليجرام الخاص بك مباشرة سيقوم سورس يـــمنثون بطرده من الحساب**\n\n"

"❃ `.تعطيل حماية الحساب`"
   " **⌔∮لأيقاف الامر اعلاه ويقوم بالسماح للدخول الى حسابك**\n\n"

"**ملاحظة: بعد تفعيل الامر سيقوم بطرد الجلسات الجديدة فقط** \n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n")
F = (
         "**¤ اوامــر الادمـــن ¤**\n\n"
     " `.رفع مشرف`  <بالرد على المستخدم/وضع يوزره>\n"
   "**لـ رفع مستخدم في المجموعة او القناة بوضع معرفه مع الامر**\n\n"

 " `.تنزيل مشرف`  <بالرد على المستخدم/وضع يوزره>\n"
   "**لـ تنزيل مستخدم من المشرفين في الدردشة ويصبح عضو عادي**\n\n"

  "`.حظر`  <بالرد على المستخدم/وضع يوزره>\n"
  " **لـ حظر المستخدم من المجموعة ومنعه من الدخول للمجموعة**\n\n"

 " `.الغاء حظر`  <بالرد على المستخدم/وضع يوزره>\n"
   "**لـ الغاء حظر المستخدم في المجموعة والسماح له بالدخول**\n\n"

 " `.طرد`  <بالرد على المستخدم/وضع يوزره>\n"
   "**لـ طرد المستخدم من المجموعة بحيث يمكنه الدخول مرة اخرى**\n\n"

 " `.تثبيت`  <بالرد على الرسالة>\n"
   "**لـ تثبيت رسالة في الدردشة بالرد على الرسالة التي تريد تثبيتها**\n\n"

"  `.الغاء تثبيت`  <بالرد على الرسالة>\n"
   "**لـ الغاء تثبيت الرسالة في الدردشة بالرد على الرسالة التي تريد الغاء تثبيتها**\n"
   "**لالغاء تثبيت جميع الرسائل استخدم** `.الغاء تثبيت الكل`\n\n"

  "`.مسح` <عدد الرسائل>\n"
   "**لـ حذف الرسائل من الدردشة بالعدد، واذا قمت بالرد على مستخدم وتعيين عدد الرسائل سيحذف رسائله فقط \n"
  " يمكنك كذلك فقط الرد على الرسالة بدون تعيين عدد وسيحذفها فقط**\n\n\n"
                "**¤ اوامــر منـــع الكـــلمات ¤**\n\n"
"❃ `.منع` <كلمة>\n"
  " **لـ منع أرسال هذه الكلمة في الدردشة واذا ارسلها مستخدم سيتم حذفها**\n\n"

"❃ `.الغاء منع` <كلمة>\n"
   "**لـ الغاء منع الكلمة والسماح للمستخدم ارسالها بدون حذفها**\n\n"

"❃ `.قائمة المنع` \n"
   " **لـ عرض قائمة الكلمات التي منعتها في الدردشة**\n\n"
   "**¤ اوامــر كشف المجموعات ¤**\n\n"
"❃ `.كشف المجموعة`\n"
     "**هـذا الامر يستخدم بالأرسال في المجموعات يقوم بفحص المجموعة ويعرض جميع معلومات المجموعة**❤️\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

H = (
    "**❃ هاذا الامر تستخدم بالأرسال فقط**\n\n"

"❃ `.بحث ايبي`  + ايبي هاتف الضحيه \n"
   "⌔∮**يستخدم هاذا الامر لتحديد موقع الضحيه من خلال الايبي** \n"
   "**المعلومات قد لا تكون دقيقة** 📵\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

I = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n"
"❃ `.سرعه النت`\n\n"

   "⌔∮**هاذا الامر يقوم بقياس سرعة الانترنت واستجابة السورس**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

J = (
    "**❃ جميع هذه الاوامر تستخدم بالرد على الشخص عدا أمر كت**\n\n"

"❃ `.رفع مطي`\n"
"❃ `.رفع كلب`\n"
"❃ `.رفع حيوان`\n"
"❃ `.رفع زاحف`\n"
"❃ `.رفع مرتي`\n"
"❃ `.رفع زوجي`\n"
"❃ `.رفع تاج`\n"
"❃ `.رفع بقلبي`\n"
"❃ `.رفع بزون`\n"
"❃ `.رفع قرد`\n\n"

"❃ `.نسبة الحب`\n"
"❃ `.نسبة الانوثة`\n"
"❃ `.نسبة الرجولة`\n"
"❃ `.نسبة الغباء`\n"
"❃ `.نسبة المثلية`\n\n"

"❃ `.كت`\n"
"❃ `.اوصف`\n"
"❃ `.هينه`\n"
"❃ `.نزوج`\n"
"❃ `.طلاق`\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

K = (
    "**❃ جميع هذه الاوامر تستخدم بالأرسال فقط**\n\n"

"❃ `.وحش`\n"
"❃ `.خنزير`\n"
"❃ `.مسدس`\n"
"❃ `.كلب`\n"
"❃ `.هلو`\n"
"❃ `.طائره`\n"
"❃ `.حبايب`\n"
"❃ `.سوبر`\n"
"❃ `.الهند`\n"
"❃ `.هلا`\n"
"❃ `.حيه`\n"
"❃ `.باي`\n"
"❃ `.خرا`\n"
"❃ `.دس لايك`\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

L = (
    "**❃ جميع هذه الاوامر تستخدم فقط بالأرسال**\n\n"

"❃ `.غبي`\n"
"❃ `.مافيا`  + اسم الشخص\n"
"❃ `.ميت`  + اسم الشخص\n"
"❃ `.القنابل`\n"
"❃ `.قتل`\n "
"❃ `.طوبة`\n"
"❃ `.مربعات`\n"
"❃ `.حلويات`\n"
"❃ `.نار`\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)


O = (
    "**❃ جميع هذه الاوامر تستخدم بالأرسال فقط**\n\n"

"❃ `.افكر`\n"
"❃ `.متت`\n"
"❃ `.ضايج`\n"
"❃ `.ساعة`\n"
"❃ `.مح`\n"
"❃ `.قلب`\n"
"❃ `.جيم`\n"
"❃ `.الارض`\n"
"❃ `.قمر`\n"
"❃ `.اقمار` ( مو اقمار الحرام لا يعني جمع قمر)\n"
"❃ `.قمور`\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

P = (
 "**  ¤ الاوامــر المتاحة حاليا ¤**\n\n"
     "❃  `.ستوري` <يوزر الشخص/الرد على الشخص>\n"
   " **⌔∮لـ حفظ وتنزيل اخر ستوري نشره المستخدم** \n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)


R = (
    "**❃ جميع هذه الاوامر تستخدم بالأرسال فقط**\n\n"

"❃ `.حالات`\n"
"❃ `.ستوري انمي`\n"
"❃ `.رقيه`\n"
"❃ `.رمادي`\n"
"❃ `.رماديه`\n"
"❃ `.بيست`\n"
"❃ `.حب`\n"
"❃ `.رياكشن`\n"
"❃ `.ادت`\n"
"❃ `.غنيلي`\n"
"❃ `.شعر`\n"
"❃ `.ميمز`\n"
"❃ `.ري اكشن`\n"
"❃ `.معلومه`\n"
"❃ `.تويت`\n"
"❃ `.خيرني`\n"
"❃ `.ولد انمي`\n"
"❃ `.بنت انمي`\n"
"❃ `.بنات`\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

a = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n\n"
"**❃ الاوامر المتاحة حاليا\n\n**"

"❃ `.حساب العمر`  +سنة الميلاد\n\n "
  
"**يستخدم الامر معا سنة الميلاد لحساب العمر**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

b = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n\n"
"❃ `.نشر` <الوقت بين الارسال> <عدد الارسال> <الرسالة>\n"
   " **لـ نشر الرسالة بعدد معين في جيمع مجموعاتك لكن بين ارسال رسالة واخرى وقت معين جرب ارسل**   `. انشرلي 2 5 مرحبا`\n\n"
   
"❃ `.ايقاف النشر`\n"
   "**لـ ايقاف امر النشر في المجموعات**\n\n"

"⚠️ **أنتبه قد يؤدي استخدام هذا الامر بكثرة الى تقييد حسابك من مراسلة المستخدمين اذا قاموا بالتبليغ عنك..**🧸♥️\n\n\n"
"**∮ الأوامر المتاحة في قائمة الاذاعة**\n\n"


"❃ .للكروبات <رسالتك>\n"
    "**لـ نشر/أذاعة الرسالة في جميع المجموعات التي لديك**\n\n"

"❃ .للخاص <رسالتك>\n"
    "**لـ نشر/أذاعة الرسالة في جميع الدردشات في الخاص التي لديك**\n\n"

"**تنبيه: يمكنك الرد على صورة او فيديو او متحركة كذلك لعمل اذاعة لها بالرد عليها بالامر🧸♥**\n\n"

"**⚠️ أنتبه قد يؤدي استخدام هذا الامر بكثرة الى تقييد حسابك من مراسلة المستخدمين اذا قاموا بالتبليغ عنك..**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

c = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n\n"
"❃ `.فحص`\n"
   " **⌔∮ لـ عرض حالة سورس يـــمنثون والاصدار و وقت التشغيل**\n\n"

'❃ **⌔∮ ملاحظة: يمكنك وضع او تغيير الصورة من خلال البوت المساعد الخاص بك**\n\n'


"❃ `.بنك`\n"
   " **⌔∮ أمر تجريبي لتجربة السورس**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

d = (
    "**❃ جميع هذه الامر تستخدم بي الرد فقط**\n\n"
"❃ `.تهكير`<بالرد على المستخدم>\n"
  "  **امر ترفيهي للمزاح مع صديقك بانك قمت ب اختراقه**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

e = (
    "**❃ جميع هذه الامر تستخدم بالأرسال والرد**\n\n"

"❃ `.ايدي`\n"
   " **هاذا الامر يستخدم لعرض معلومات المستخدم برد عليه او بالأرسال فقط لعرض معلوماتك**\n\n"
    
"❃ `.ا` \n"
   " **هاذا الامر إختصار للامر (ايدي) يعمل نفس الوظيفة**\n\n"

"❃ `.صورته`\n"
   " **هاذا الامر يستخدم بي الرد على المستخدم لجلب اول صوره لحساب الشخص**\n\n"
    
"❃ `.صورته`  + عدد الصور\n"
    "**هاذا الامر يستخدم معا العدد لجلب العدد المطلوب لصور حساب الشخص**\n\n"

"❃ `.صوته الكل`\n"
    "**هاذا الامر يقوم بجلب جميع صور المستخدم**\n\n"
    
"❃ `.رابطه`\n"
    "**لـ جـلب اسـم الشخـص بشكـل ماركـدون ⦇.رابطه بالـرد او + معـرف/ايـدي الشخص⦈**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

f = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n\n"
"❃ `.تفليش بالبوت`\n"
 " **اذا كنت ادمن في بوت الحماية المضاف في المجموعة (لست مشرف بل وأنما عندك رتبة في بوت الحماية فقط) من خلال هذا الامر يمكنك حظر جميع الاعضاء بـ استخدام بوت الحماية**\n\n"

"❃ `.ايقاف التفليش`\n"
  "**لـ ايقاف عملية التفليش بالبوت** \n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

g = (
    "**❃ جميع هذه الامر تستخدم بالأرسال**\n"
"❃ `.سبام` <عدد الرسائل> <رسالتك>\n"
 " `.سبام` <عدد الرسائل> <بالرد على رسالة\n"
   " **لـ تكرار ارسال الرسالة في الدردشة المستخدم بها الامر اكثر رقم هو 99**\n\n"

"❃ `.مكرر` <الوقت بين الارسال> <عدد الارسال> <الرسالة>\n"
    "**لـ تكرار ارسال الرسالة بعدد معين في الدردشة لكن بين ارسال رسالة واخرى وقت معين جرب ارسل**   `. مكرر 2 5 مرحبا`\n\n"

"❃ `.فصخ`<جملة>\n"
 " **لـ تفصيخ الجملة وجعلها امام المستخدم تكتب بشكل حرف حرف**\n\n"
   
"❃ `.ايقاف مكرر`\n"
  " **لـ ايقاف امر مكرر/مؤقت في الدردشة**\n\n"

  " ⚠️ **ملاحظة مهمة: قد يرى التليجرام اوامر السبام/التكرار مخالفة لسياسته و قد يؤدي استخدامها الى حظر او حذف حسابك ف انت المسوؤل الوحيد عن ما سيحصل لحسابك لان في سياسة التليجرام يمنع عمل رسائل مكررة و سبام**🧸♥️\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

h = (
    "**❃ جميع هذه الامر تستخدم بالأرسال **\n\n"
"❃ `.اضف متحكم` [ايدي الشخص/الرد عليه]\n"
    "**⌔∮لـ أضافة متحكم لحسابك يمكنه استخدام اوامر يـــمنثون بأستخدام حسابك** \n\n"
    
"❃ `.حذف متحكم` [ايدي الشخص/الرد عليه]\n"
    "**⌔∮لـحذف متحكم من استخدام سورس يـــمنثون الخاص بك**\n\n"

"❃ `.المتحكمين`\n"
   " **⌔∮لـ عرض قائمة المستخدمين الذي يمكنهم التحكم بحسابك**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

i = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n\n"
"❃ `.ايقاف الحفظ\n"
   "**يستخدم هذا بأرساله عند المستخدم في الدردشة الخاصة**\n"
    "**⌔∮لـ أيقاف تخزين الرسائل من المستخدم في مجموعة التخزين**\n\n"

"❃ `.تشغيل الحفظ`\n"
   " **يستخدم هذا بأرساله عند المستخدم في الدردشة الخاصة**\n"
   " **⌔∮لـ أرجاع تخزين الرسائل من المستخدم في مجموعة التخزين**\n\n"

"**⌔∮ ملاحظة: سورس يـــمنثون يقوم بحفظ الصور و الفيديوهات و الصوتيات ذاتية التدمير الى مجموعة التخزين بشكل تلقائي وكذلك يقوم بحفظ التاك في كروب التخزين**🧸♥️\n\n"

"**⌔∮ هذه الاوامر تعمل فقط حين تشغيل نظام حماية الخاص🧸♥️**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

j = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n\n"
"❃ `.انتحال <بالرد على الشخص/يوزره>`\n"
    "**⌔∮لـ انتحال حساب المستخدم من اسم وصورة الخ..**\n\n" 

"❃ `.اعادة`\n"
    "**⌔∮لـ رجوع الحساب الى وضعه الطبيعي**\n\n"
    
"⚠️ **⌔∮تـنبيـه : هذه الامر قد يكون مخالف لسياسة التليجرام اذا تم التبليغ عنك بصفة أنتحال لذا أستعمله حسب مسؤوليتك⌔∮**\n\n\n"
"¤  اوامــر التقليد  ¤ \n\n"
"❃ `.تقليد` <بالرد على الشخص/يوزره>\n"
    "**⌔∮لـ اعادة ارسال اي شيء سيرسله المستخدم في المحادثة وتقليده**\n\n"

"❃ `.حذف_تقليد` <بالرد على الشخص/يوزره>\n"
    "**⌔∮لـ رجوع الحساب الى وضعه الطبيعي**\n\n"
    
"❃ `.قائمة التقليد`\n"
    "**⌔∮لـ عرض قائمة المستخدمين الذي قمت بتقليدهم**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)
k = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n\n"
"**⌔∮ الأوامر المتاحة في قائمة الملصقات**\n"

"❃ `.ستيكر` [الرد على: صورة/ملصق/نص]\n"
    "**⌔∮لـ صنع حزمة ملصقات وأضافة الصورة او النص او الملصق الذي تم الرد عليه**\n\n"

"❃ `.حزمة` <اسم الحزمة>\n"
    "**⌔∮لـ سرقة الحزمة التي تم الرد عليها وصنع حزمة جديدة لك منها**\n\n"

"❃ `.الحزم`\n"
   " **⌔∮لـعرض قائمة حُزم الملصقات التي تم صنعها**\n\n\n"
  " **⌔∮ الأوامر المتاحة في قائمة حذف المتحركات**\n\n"

"❃ `.ازالة متحركات` <عدد>\n"
  "** ⌔∮لـ حذف المتحركات المحفوظة في حسابك ويمكنك حذف جميع المتحركات اذا وضعت كلمة الكل في مكان العدد**\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)
l = (
    "**❃ جميع هذه الامر تستخدم بالأرسال فقط**\n"
"❃ `.لوك`\n"
    "**⌔∮لـ عرض اخر أسطر من عملية التنصيب وعرض سجل العمليات**\n\n"
    
"❃ `.اعادة تشغيل`\n"
    "**⌔∮لـ اعادة تشغيل سورس يـــمنثون** ( الافضل تستخدمه في مجموعة السجل )\n\n"
    
"❃ `.تحديث`\n"
   " **⌔∮لـ تحديث سورس يـــمنثون اذا كان هنالك تحديث جديد ولمعرفة التحديثات تابع** @YamenThon\n\n"
"𓆰 [𝗬𝘼𝗠ِ𝗘𝙉ِ𝗧𝙃َ𝗢𝙉ِ - سورس يـــمنثون](t.me/YamenThon) 𓆪\n"
"⋆┄─┄─┄─┄┄─┄─┄─┄─┄┄⋆\n"
)

@jmthon_cmd(pattern=r"الاوامر$")
async def _(event):
    event = await eor(event, A)


@jmthon_cmd(pattern=r"م1$")
async def _(event):
    event = await eor(event, B)


@jmthon_cmd(pattern=r"م2$")
async def _(event):
    event = await eor(event, D)


@jmthon_cmd(pattern=r"م3$")
async def _(event):
    event = await eor(event, E)


@jmthon_cmd(pattern=r"م4$")
async def _(event):
    event = await eor(event, F)


@jmthon_cmd(pattern=r"م5$")
async def _(event):
    event = await eor(event, G)


@jmthon_cmd(pattern=r"م6$")
async def _(event):
    event = await eor(event, H)


@jmthon_cmd(pattern=r"م7$")
async def _(event):
    event = await eor(event, I)


@jmthon_cmd(pattern=r"م8$")
async def _(event):
    event = await eor(event, J)


@jmthon_cmd(pattern=r"م9$")
async def _(event):
    event = await eor(event, K)


@jmthon_cmd(pattern=r"م10$")
async def _(event):
    event = await eor(event, L)


@jmthon_cmd(pattern=r"م11$")
async def _(event):
    event = await eor(event, O)


@jmthon_cmd(pattern=r"م12$")
async def _(event):
    event = await eor(event, P)


@jmthon_cmd(pattern=r"م13$")
async def _(event):
    event = await eor(event, R)

@jmthon_cmd(pattern=r"م14$")
async def _(event):
    event = await eor(event, a)

@jmthon_cmd(pattern=r"م15$")
async def _(event):
    event = await eor(event, b)

@jmthon_cmd(pattern=r"م16$")
async def _(event):
    event = await eor(event, c)    
    
@jmthon_cmd(pattern=r"م17$")
async def _(event):
    event = await eor(event, d)    
    
@jmthon_cmd(pattern=r"م18$")
async def _(event):
    event = await eor(event, e)    
    
@jmthon_cmd(pattern=r"م19$")
async def _(event):
    event = await eor(event, f)    
    
@jmthon_cmd(pattern=r"م20$")
async def _(event):
    event = await eor(event, g)    
    
@jmthon_cmd(pattern=r"م21$")
async def _(event):
    event = await eor(event, h)    
    
@jmthon_cmd(pattern=r"م22$")
async def _(event):
    event = await eor(event, i)    
    
@jmthon_cmd(pattern=r"م23$")
async def _(event):
    event = await eor(event, j)    

@jmthon_cmd(pattern=r"م24$")
async def _(event):
    event = await eor(event, k)    

@jmthon_cmd(pattern=r"م25$")
async def _(event):
    event = await eor(event, l)    
           
# Copyright (C) 2022  . All Rights Reserved
@jmthon_cmd(pattern="تسليه")
async def cmd(zelzallll):
    await edit_or_reply(zelzallll, Fun_cmd)
